_posts/2013-12-08-Selectively-exporting-headlines-in-org-mode.html
---
title: Selectively exporting headlines in org-mode
date: 2013/12/08 16:35:35
updated: 2013/12/08 16:35:35
categories: org-mode
tags: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. problem 1&#xa0;&#xa0;&#xa0;<span class="tag"><span class="problem">problem</span></span></a>
<ul>
<li><a href="#sec-1-1">1.1. solution to problem 1&#xa0;&#xa0;&#xa0;<span class="tag"><span class="solution">solution</span></span></a></li>
</ul>
</li>
<li><a href="#sec-2">2. problem 2&#xa0;&#xa0;&#xa0;<span class="tag"><span class="problem">problem</span></span></a>
<ul>
<li><a href="#sec-2-1">2.1. solution to problem 2&#xa0;&#xa0;&#xa0;<span class="tag"><span class="solution">solution</span></span></a></li>
</ul>
</li>
<li><a href="#sec-3">3. Code to export&#xa0;&#xa0;&#xa0;<span class="tag"><span class="code">code</span></span></a>
<ul>
<li><a href="#sec-3-1">3.1. Export just the problems</a></li>
<li><a href="#sec-3-2">3.2. Problems and solutions</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Summary</a></li>
</ul>
</div>
</div>
<p>
I have on several occasions needed to selectively export only portions of an org document. For example, I may write a problem set or exam, and have some headlines that are the problems, and others that are the solutions. Or, I may have done some analysis in a headline, e.g. statistics of problem scores that I do not want in exported content, or I have a manuscript with a supporting information section that does not go in the exported manuscript, and the manuscript cannot go in the supporting information file. 
</p>

<p>
org-mode supports <a href="http://www.gnu.org/software/emacs/manual/html_node/org/Selective-export.html">selective export</a> through use of tags. However, this is inflexible if you want to export multiple different documents with different selective exports, unless you don't mind changing the settings, or commenting and uncommenting lines all the time. 
</p>

<p>
Enter dynamic binding of variables in emacs-lisp. We can temporarily define variables, especially <code>org-export-select-tags</code> and <code>org-export-exclude-tags</code>, and write emacs-lisp code blocks to export the current document the way we want. First, let us create some headlines.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> problem 1&#xa0;&#xa0;&#xa0;<span class="tag"><span class="problem">problem</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
description of a hard problem
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> solution to problem 1&#xa0;&#xa0;&#xa0;<span class="tag"><span class="solution">solution</span></span></h3>
<div class="outline-text-3" id="text-1-1">
<p>
it is an easy solution
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> problem 2&#xa0;&#xa0;&#xa0;<span class="tag"><span class="problem">problem</span></span></h2>
<div class="outline-text-2" id="text-2">
<p>
what is the square root of 100?
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> solution to problem 2&#xa0;&#xa0;&#xa0;<span class="tag"><span class="solution">solution</span></span></h3>
<div class="outline-text-3" id="text-2-1">
<p>
why it's 10 of course.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Code to export&#xa0;&#xa0;&#xa0;<span class="tag"><span class="code">code</span></span></h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Export just the problems</h3>
<div class="outline-text-3" id="text-3-1">
<p>
First, let us output this document with just the problems. The code block does that, just put your cursor in in block and press C-c C-c (in emacs of course). 
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">let</span> ((org-export-exclude-tags '(<span style="color: #228b22;">"solution"</span> <span style="color: #228b22;">"code"</span>))
      (org-latex-default-packages-alist
       '((<span style="color: #228b22;">""</span> <span style="color: #228b22;">"lmodern"</span> nil)
         (<span style="color: #228b22;">"linktocpage,</span>
<span style="color: #228b22;">  pdfstartview=FitH,</span>
<span style="color: #228b22;">  colorlinks,</span>
<span style="color: #228b22;">  linkcolor=blue,</span>
<span style="color: #228b22;">  anchorcolor=blue,</span>
<span style="color: #228b22;">  citecolor=blue,</span>
<span style="color: #228b22;">  filecolor=blue,</span>
<span style="color: #228b22;">  menucolor=blue,</span>
<span style="color: #228b22;">  urlcolor=blue"</span> <span style="color: #228b22;">"hyperref"</span> t)))
      (async nil)
      (subtreep nil)
      (visible-only nil)
      (body-only nil)
      (ext-plist '()))
  (org-latex-export-to-pdf async subtreep visible-only body-only ext-plist))
(rename-file <span style="color: #228b22;">"blog.pdf"</span> <span style="color: #228b22;">"blog-1.pdf"</span>)
</pre>
</div>

<p>
You get this: <a href="/media/2013-12-08-Selectively-exporting-headlines-in-org-mode/blog-1.pdf">blog-1.pdf</a> which only has the problems in it.
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Problems and solutions</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Next, we consider the problems and the solutions. We cannot just get solutions in this document because solutions are nested in the problems.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">let</span> ((org-export-exclude-tags '(<span style="color: #228b22;">"code"</span>))
      (org-latex-default-packages-alist
       '((<span style="color: #228b22;">""</span> <span style="color: #228b22;">"lmodern"</span> nil)
         (<span style="color: #228b22;">"linktocpage,</span>
<span style="color: #228b22;">  pdfstartview=FitH,</span>
<span style="color: #228b22;">  colorlinks,</span>
<span style="color: #228b22;">  linkcolor=blue,</span>
<span style="color: #228b22;">  anchorcolor=blue,</span>
<span style="color: #228b22;">  citecolor=blue,</span>
<span style="color: #228b22;">  filecolor=blue,</span>
<span style="color: #228b22;">  menucolor=blue,</span>
<span style="color: #228b22;">  urlcolor=blue"</span> <span style="color: #228b22;">"hyperref"</span> t)))
      (async nil)
      (subtreep nil)
      (visible-only nil)
      (body-only nil)
      (ext-plist '()))
  (org-latex-export-to-pdf async subtreep visible-only body-only ext-plist))
(rename-file <span style="color: #228b22;">"blog.pdf"</span> <span style="color: #228b22;">"blog-2.pdf"</span> t)
</pre>
</div>

<p>
This document (<a href="/media/2013-12-08-Selectively-exporting-headlines-in-org-mode/blog-2.pdf">blog-2.pdf</a> ) now has problems and solutions. Note that neither of these documents has the section we labeled <code>:code:</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Summary</h2>
<div class="outline-text-2" id="text-4">
<p>
Tags are a nice way to label sections. In combination with dynamic binding, you can build code blocks that selectively export pieces of an org-file by temporarily defining the values of variables. In this example, there are four versions of this document: 1) the org-file that contains everything, 2) the html blog post, 3) a pdf with the problems, and 4) a pdf with problems and solutions. Good luck getting that out of a Word file ;)
</p>
</div>
</div>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/12/08/Selectively-exporting-headlines-in-org-mode.org">org-mode source</a><p>